Tekla Open API Reference for Tekla Structures 2025
RebarLegFace Properties
The RebarLegFace type exposes the following members.
Properties
Name | Description
AdditonalOffset
 Gets or sets the user defined offset of the rebars from the rebar leg face.
Contour
 Gets or sets the outer Contour of the rebar leg face.
Id
 Gets or sets an identifier that may be used to identify instances of the same rebar leg face.
LayerOrderNumber
 Gets or sets the layer order number of the rebar leg face.
Reversed
 Gets or sets a value indicating whether the cover thickness is opposite to the coordinate system Z direction for the rebar leg face.
Top
See Also
Reference
RebarLegFace Class
Tekla.Structures.Model Namespace